MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K80/mcu.h
extern volatile RXF12EIDLbits_t RXF12EIDLbits __at(0xE63);
// bitfield macros
#define _RXF12EIDL_EID_POSN                                 0x0
#define _RXF12EIDL_EID_POSITION                             0x0
#define _RXF12EIDL_EID_SIZE                                 0x8
#define _RXF12EIDL_EID_LENGTH                               0x8
#define _RXF12EIDL_EID_MASK                                 0xFF
#define _RXF12EIDL_EID0_POSN                                0x0
#define _RXF12EIDL_EID0_POSITION                            0x0
#define _RXF12EIDL_EID0_SIZE                                0x1
#define _RXF12EIDL_EID0_LENGTH                              0x1
#define _RXF12EIDL_EID0_MASK                                0x1
#define _RXF12EIDL_EID1_POSN                                0x1
#define _RXF12EIDL_EID1_POSITION                            0x1
#define _RXF12EIDL_EID1_SIZE                                0x1
#define _RXF12EIDL_EID1_LENGTH                              0x1
#define _RXF12EIDL_EID1_MASK                                0x2
#define _RXF12EIDL_EID2_POSN                                0x2
#define _RXF12EIDL_EID2_POSITION                            0x2
#define _RXF12EIDL_EID2_SIZE                                0x1
#define _RXF12EIDL_EID2_LENGTH                              0x1
#define _RXF12EIDL_EID2_MASK                                0x4
#define _RXF12EIDL_EID3_POSN                                0x3
#define _RXF12EIDL_EID3_POSITION                            0x3
#define _RXF12EIDL_EID3_SIZE                                0x1
#define _RXF12EIDL_EID3_LENGTH                              0x1
#define _RXF12EIDL_EID3_MASK                                0x8
#define _RXF12EIDL_EID4_POSN                                0x4
#define _RXF12EIDL_EID4_POSITION                            0x4
#define _RXF12EIDL_EID4_SIZE                                0x1
#define _RXF12EIDL_EID4_LENGTH                              0x1
#define _RXF12EIDL_EID4_MASK                                0x10
#define _RXF12EIDL_EID5_POSN                                0x5
#define _RXF12EIDL_EID5_POSITION                            0x5
#define _RXF12EIDL_EID5_SIZE                                0x1
#define _RXF12EIDL_EID5_LENGTH                              0x1
#define _RXF12EIDL_EID5_MASK                                0x20
#define _RXF12EIDL_EID6_POSN                                0x6
#define _RXF12EIDL_EID6_POSITION                            0x6
#define _RXF12EIDL_EID6_SIZE                                0x1
#define _RXF12EIDL_EID6_LENGTH                              0x1
#define _RXF12EIDL_EID6_MASK                                0x40
#define _RXF12EIDL_EID7_POSN                                0x7
#define _RXF12EIDL_EID7_POSITION                            0x7
#define _RXF12EIDL_EID7_SIZE                                0x1
#define _RXF12EIDL_EID7_LENGTH                              0x1
#define _RXF12EIDL_EID7_MASK                                0x80
#define _RXF12EIDL_RXF12EID0_POSN                           0x0
#define _RXF12EIDL_RXF12EID0_POSITION                       0x0
#define _RXF12EIDL_RXF12EID0_SIZE                           0x1
#define _RXF12EIDL_RXF12EID0_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID0_MASK                           0x1
#define _RXF12EIDL_RXF12EID1_POSN                           0x1
#define _RXF12EIDL_RXF12EID1_POSITION                       0x1
#define _RXF12EIDL_RXF12EID1_SIZE                           0x1
#define _RXF12EIDL_RXF12EID1_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID1_MASK                           0x2
#define _RXF12EIDL_RXF12EID2_POSN                           0x2
#define _RXF12EIDL_RXF12EID2_POSITION                       0x2
#define _RXF12EIDL_RXF12EID2_SIZE                           0x1
#define _RXF12EIDL_RXF12EID2_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID2_MASK                           0x4
#define _RXF12EIDL_RXF12EID3_POSN                           0x3
#define _RXF12EIDL_RXF12EID3_POSITION                       0x3
#define _RXF12EIDL_RXF12EID3_SIZE                           0x1
#define _RXF12EIDL_RXF12EID3_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID3_MASK                           0x8
#define _RXF12EIDL_RXF12EID4_POSN                           0x4
#define _RXF12EIDL_RXF12EID4_POSITION                       0x4
#define _RXF12EIDL_RXF12EID4_SIZE                           0x1
#define _RXF12EIDL_RXF12EID4_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID4_MASK                           0x10
#define _RXF12EIDL_RXF12EID5_POSN                           0x5
#define _RXF12EIDL_RXF12EID5_POSITION                       0x5
#define _RXF12EIDL_RXF12EID5_SIZE                           0x1
#define _RXF12EIDL_RXF12EID5_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID5_MASK                           0x20
#define _RXF12EIDL_RXF12EID6_POSN                           0x6
#define _RXF12EIDL_RXF12EID6_POSITION                       0x6
#define _RXF12EIDL_RXF12EID6_SIZE                           0x1
#define _RXF12EIDL_RXF12EID6_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID6_MASK                           0x40
#define _RXF12EIDL_RXF12EID7_POSN                           0x7
#define _RXF12EIDL_RXF12EID7_POSITION                       0x7
#define _RXF12EIDL_RXF12EID7_SIZE                           0x1
#define _RXF12EIDL_RXF12EID7_LENGTH                         0x1
#define _RXF12EIDL_RXF12EID7_MASK                           0x80

// Register: RXF13SIDH
#define RXF13SIDH RXF13SIDH
extern volatile unsigned char           RXF13SIDH           __at(0xE64);
#ifndef _LIB_BUILD
asm("RXF13SIDH equ 0E64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF13SID3              :1;
        unsigned RXF13SID4              :1;
        unsigned RXF13SID5              :1;
        unsigned RXF13SID6              :1;
        unsigned RXF13SID7              :1;
        unsigned RXF13SID8              :1;
        unsigned RXF13SID9              :1;
        unsigned RXF13SID10             :1;
    };
} RXF13SIDHbits_t;
extern volatile RXF13SIDHbits_t RXF13SIDHbits __at(0xE64);
// bitfield macros
#define _RXF13SIDH_SID_POSN                                 0x0
#define _RXF13SIDH_SID_POSITION                             0x0
#define _RXF13SIDH_SID_SIZE                                 0x8
#define _RXF13SIDH_SID_LENGTH                               0x8
#define _RXF13SIDH_SID_MASK                                 0xFF
#define _RXF13SIDH_SID3_POSN                                0x0
#define _RXF13SIDH_SID3_POSITION                            0x0
#define _RXF13SIDH_SID3_SIZE                                0x1
#define _RXF13SIDH_SID3_LENGTH                              0x1
#define _RXF13SIDH_SID3_MASK                                0x1
#define _RXF13SIDH_SID4_POSN                                0x1
#define _RXF13SIDH_SID4_POSITION                            0x1
#define _RXF13SIDH_SID4_SIZE                                0x1
#define _RXF13SIDH_SID4_LENGTH                              0x1
#define _RXF13SIDH_SID4_MASK                                0x2
#define _RXF13SIDH_SID5_POSN                                0x2
#define _RXF13SIDH_SID5_POSITION                            0x2
#define _RXF13SIDH_SID5_SIZE                                0x1
#define _RXF13SIDH_SID5_LENGTH                              0x1
#define _RXF13SIDH_SID5_MASK                                0x4
#define _RXF13SIDH_SID6_POSN                                0x3
#define _RXF13SIDH_SID6_POSITION                            0x3
#define _RXF13SIDH_SID6_SIZE                                0x1
#define _RXF13SIDH_SID6_LENGTH                              0x1
#define _RXF13SIDH_SID6_MASK                                0x8
#define _RXF13SIDH_SID7_POSN                                0x4
#define _RXF13SIDH_SID7_POSITION                            0x4
#define _RXF13SIDH_SID7_SIZE                                0x1
#define _RXF13SIDH_SID7_LENGTH                              0x1
#define _RXF13SIDH_SID7_MASK                                0x10
#define _RXF13SIDH_SID8_POSN                                0x5
#define _RXF13SIDH_SID8_POSITION                            0x5
#define _RXF13SIDH_SID8_SIZE                                0x1
#define _RXF13SIDH_SID8_LENGTH                              0x1
#define _RXF13SIDH_SID8_MASK                                0x20
#define _RXF13SIDH_SID9_POSN                                0x6
#define _RXF13SIDH_SID9_POSITION                            0x6
#define _RXF13SIDH_SID9_SIZE                                0x1
#define _RXF13SIDH_SID9_LENGTH                              0x1
#define _RXF13SIDH_SID9_MASK                                0x40
#define _RXF13SIDH_SID10_POSN                               0x7
#define _RXF13SIDH_SID10_POSITION                           0x7
#define _RXF13SIDH_SID10_SIZE                               0x1
#define _RXF13SIDH_SID10_LENGTH                             0x1
#define _RXF13SIDH_SID10_MASK                               0x80
#define _RXF13SIDH_RXF13SID3_POSN                           0x0
#define _RXF13SIDH_RXF13SID3_POSITION                       0x0
#define _RXF13SIDH_RXF13SID3_SIZE                           0x1
#define _RXF13SIDH_RXF13SID3_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID3_MASK                           0x1
#define _RXF13SIDH_RXF13SID4_POSN                           0x1
#define _RXF13SIDH_RXF13SID4_POSITION                       0x1
#define _RXF13SIDH_RXF13SID4_SIZE                           0x1
#define _RXF13SIDH_RXF13SID4_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID4_MASK                           0x2
#define _RXF13SIDH_RXF13SID5_POSN                           0x2
#define _RXF13SIDH_RXF13SID5_POSITION                       0x2
#define _RXF13SIDH_RXF13SID5_SIZE                           0x1
#define _RXF13SIDH_RXF13SID5_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID5_MASK                           0x4
#define _RXF13SIDH_RXF13SID6_POSN                           0x3
#define _RXF13SIDH_RXF13SID6_POSITION                       0x3
#define _RXF13SIDH_RXF13SID6_SIZE                           0x1
#define _RXF13SIDH_RXF13SID6_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID6_MASK                           0x8
#define _RXF13SIDH_RXF13SID7_POSN                           0x4
#define _RXF13SIDH_RXF13SID7_POSITION                       0x4
#define _RXF13SIDH_RXF13SID7_SIZE                           0x1
#define _RXF13SIDH_RXF13SID7_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID7_MASK                           0x10
#define _RXF13SIDH_RXF13SID8_POSN                           0x5
#define _RXF13SIDH_RXF13SID8_POSITION                       0x5
#define _RXF13SIDH_RXF13SID8_SIZE                           0x1
#define _RXF13SIDH_RXF13SID8_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID8_MASK                           0x20
#define _RXF13SIDH_RXF13SID9_POSN                           0x6
#define _RXF13SIDH_RXF13SID9_POSITION                       0x6
#define _RXF13SIDH_RXF13SID9_SIZE                           0x1
#define _RXF13SIDH_RXF13SID9_LENGTH                         0x1
#define _RXF13SIDH_RXF13SID9_MASK                           0x40
#define _RXF13SIDH_RXF13SID10_POSN                          0x7
#define _RXF13SIDH_RXF13SID10_POSITION                      0x7
#define _RXF13SIDH_RXF13SID10_SIZE                          0x1
#define _RXF13SIDH_RXF13SID10_LENGTH                        0x1
#define _RXF13SIDH_RXF13SID10_MASK                          0x80

