MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K80/mcu.h
extern volatile B2D2bits_t B2D2bits __at(0xEA8);
// bitfield macros
#define _B2D2_B2D2_POSN                                     0x0
#define _B2D2_B2D2_POSITION                                 0x0
#define _B2D2_B2D2_SIZE                                     0x8
#define _B2D2_B2D2_LENGTH                                   0x8
#define _B2D2_B2D2_MASK                                     0xFF
#define _B2D2_B2D20_POSN                                    0x0
#define _B2D2_B2D20_POSITION                                0x0
#define _B2D2_B2D20_SIZE                                    0x1
#define _B2D2_B2D20_LENGTH                                  0x1
#define _B2D2_B2D20_MASK                                    0x1
#define _B2D2_B2D21_POSN                                    0x1
#define _B2D2_B2D21_POSITION                                0x1
#define _B2D2_B2D21_SIZE                                    0x1
#define _B2D2_B2D21_LENGTH                                  0x1
#define _B2D2_B2D21_MASK                                    0x2
#define _B2D2_B2D22_POSN                                    0x2
#define _B2D2_B2D22_POSITION                                0x2
#define _B2D2_B2D22_SIZE                                    0x1
#define _B2D2_B2D22_LENGTH                                  0x1
#define _B2D2_B2D22_MASK                                    0x4
#define _B2D2_B2D23_POSN                                    0x3
#define _B2D2_B2D23_POSITION                                0x3
#define _B2D2_B2D23_SIZE                                    0x1
#define _B2D2_B2D23_LENGTH                                  0x1
#define _B2D2_B2D23_MASK                                    0x8
#define _B2D2_B2D24_POSN                                    0x4
#define _B2D2_B2D24_POSITION                                0x4
#define _B2D2_B2D24_SIZE                                    0x1
#define _B2D2_B2D24_LENGTH                                  0x1
#define _B2D2_B2D24_MASK                                    0x10
#define _B2D2_B2D25_POSN                                    0x5
#define _B2D2_B2D25_POSITION                                0x5
#define _B2D2_B2D25_SIZE                                    0x1
#define _B2D2_B2D25_LENGTH                                  0x1
#define _B2D2_B2D25_MASK                                    0x20
#define _B2D2_B2D26_POSN                                    0x6
#define _B2D2_B2D26_POSITION                                0x6
#define _B2D2_B2D26_SIZE                                    0x1
#define _B2D2_B2D26_LENGTH                                  0x1
#define _B2D2_B2D26_MASK                                    0x40
#define _B2D2_B2D27_POSN                                    0x7
#define _B2D2_B2D27_POSITION                                0x7
#define _B2D2_B2D27_SIZE                                    0x1
#define _B2D2_B2D27_LENGTH                                  0x1
#define _B2D2_B2D27_MASK                                    0x80

// Register: B2D3
#define B2D3 B2D3
extern volatile unsigned char           B2D3                __at(0xEA9);
#ifndef _LIB_BUILD
asm("B2D3 equ 0EA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D3                   :8;
    };
    struct {
        unsigned B2D30                  :1;
        unsigned B2D31                  :1;
        unsigned B2D32                  :1;
        unsigned B2D33                  :1;
        unsigned B2D34                  :1;
        unsigned B2D35                  :1;
        unsigned B2D36                  :1;
        unsigned B2D37                  :1;
    };
} B2D3bits_t;
extern volatile B2D3bits_t B2D3bits __at(0xEA9);
// bitfield macros
#define _B2D3_B2D3_POSN                                     0x0
#define _B2D3_B2D3_POSITION                                 0x0
#define _B2D3_B2D3_SIZE                                     0x8
#define _B2D3_B2D3_LENGTH                                   0x8
#define _B2D3_B2D3_MASK                                     0xFF
#define _B2D3_B2D30_POSN                                    0x0
#define _B2D3_B2D30_POSITION                                0x0
#define _B2D3_B2D30_SIZE                                    0x1
#define _B2D3_B2D30_LENGTH                                  0x1
#define _B2D3_B2D30_MASK                                    0x1
#define _B2D3_B2D31_POSN                                    0x1
#define _B2D3_B2D31_POSITION                                0x1
#define _B2D3_B2D31_SIZE                                    0x1
#define _B2D3_B2D31_LENGTH                                  0x1
#define _B2D3_B2D31_MASK                                    0x2
#define _B2D3_B2D32_POSN                                    0x2
#define _B2D3_B2D32_POSITION                                0x2
#define _B2D3_B2D32_SIZE                                    0x1
#define _B2D3_B2D32_LENGTH                                  0x1
#define _B2D3_B2D32_MASK                                    0x4
#define _B2D3_B2D33_POSN                                    0x3
#define _B2D3_B2D33_POSITION                                0x3
#define _B2D3_B2D33_SIZE                                    0x1
#define _B2D3_B2D33_LENGTH                                  0x1
#define _B2D3_B2D33_MASK                                    0x8
#define _B2D3_B2D34_POSN                                    0x4
#define _B2D3_B2D34_POSITION                                0x4
#define _B2D3_B2D34_SIZE                                    0x1
#define _B2D3_B2D34_LENGTH                                  0x1
#define _B2D3_B2D34_MASK                                    0x10
#define _B2D3_B2D35_POSN                                    0x5
#define _B2D3_B2D35_POSITION                                0x5
#define _B2D3_B2D35_SIZE                                    0x1
#define _B2D3_B2D35_LENGTH                                  0x1
#define _B2D3_B2D35_MASK                                    0x20
#define _B2D3_B2D36_POSN                                    0x6
#define _B2D3_B2D36_POSITION                                0x6
#define _B2D3_B2D36_SIZE                                    0x1
#define _B2D3_B2D36_LENGTH                                  0x1
#define _B2D3_B2D36_MASK                                    0x40
#define _B2D3_B2D37_POSN                                    0x7
#define _B2D3_B2D37_POSITION                                0x7
#define _B2D3_B2D37_SIZE                                    0x1
#define _B2D3_B2D37_LENGTH                                  0x1
#define _B2D3_B2D37_MASK                                    0x80

