MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K80/mcu.h
extern volatile RXM0SIDLbits_t RXM0SIDLbits __at(0xEF9);
// bitfield macros
#define _RXM0SIDL_EID_POSN                                  0x0
#define _RXM0SIDL_EID_POSITION                              0x0
#define _RXM0SIDL_EID_SIZE                                  0x2
#define _RXM0SIDL_EID_LENGTH                                0x2
#define _RXM0SIDL_EID_MASK                                  0x3
#define _RXM0SIDL_EXIDEN_POSN                               0x3
#define _RXM0SIDL_EXIDEN_POSITION                           0x3
#define _RXM0SIDL_EXIDEN_SIZE                               0x1
#define _RXM0SIDL_EXIDEN_LENGTH                             0x1
#define _RXM0SIDL_EXIDEN_MASK                               0x8
#define _RXM0SIDL_SID_POSN                                  0x5
#define _RXM0SIDL_SID_POSITION                              0x5
#define _RXM0SIDL_SID_SIZE                                  0x3
#define _RXM0SIDL_SID_LENGTH                                0x3
#define _RXM0SIDL_SID_MASK                                  0xE0
#define _RXM0SIDL_EID16_POSN                                0x0
#define _RXM0SIDL_EID16_POSITION                            0x0
#define _RXM0SIDL_EID16_SIZE                                0x1
#define _RXM0SIDL_EID16_LENGTH                              0x1
#define _RXM0SIDL_EID16_MASK                                0x1
#define _RXM0SIDL_EID17_POSN                                0x1
#define _RXM0SIDL_EID17_POSITION                            0x1
#define _RXM0SIDL_EID17_SIZE                                0x1
#define _RXM0SIDL_EID17_LENGTH                              0x1
#define _RXM0SIDL_EID17_MASK                                0x2
#define _RXM0SIDL_SID0_POSN                                 0x5
#define _RXM0SIDL_SID0_POSITION                             0x5
#define _RXM0SIDL_SID0_SIZE                                 0x1
#define _RXM0SIDL_SID0_LENGTH                               0x1
#define _RXM0SIDL_SID0_MASK                                 0x20
#define _RXM0SIDL_SID1_POSN                                 0x6
#define _RXM0SIDL_SID1_POSITION                             0x6
#define _RXM0SIDL_SID1_SIZE                                 0x1
#define _RXM0SIDL_SID1_LENGTH                               0x1
#define _RXM0SIDL_SID1_MASK                                 0x40
#define _RXM0SIDL_SID2_POSN                                 0x7
#define _RXM0SIDL_SID2_POSITION                             0x7
#define _RXM0SIDL_SID2_SIZE                                 0x1
#define _RXM0SIDL_SID2_LENGTH                               0x1
#define _RXM0SIDL_SID2_MASK                                 0x80
#define _RXM0SIDL_RXM0EID16_POSN                            0x0
#define _RXM0SIDL_RXM0EID16_POSITION                        0x0
#define _RXM0SIDL_RXM0EID16_SIZE                            0x1
#define _RXM0SIDL_RXM0EID16_LENGTH                          0x1
#define _RXM0SIDL_RXM0EID16_MASK                            0x1
#define _RXM0SIDL_RXM0EID17_POSN                            0x1
#define _RXM0SIDL_RXM0EID17_POSITION                        0x1
#define _RXM0SIDL_RXM0EID17_SIZE                            0x1
#define _RXM0SIDL_RXM0EID17_LENGTH                          0x1
#define _RXM0SIDL_RXM0EID17_MASK                            0x2
#define _RXM0SIDL_RXM0EXIDM_POSN                            0x3
#define _RXM0SIDL_RXM0EXIDM_POSITION                        0x3
#define _RXM0SIDL_RXM0EXIDM_SIZE                            0x1
#define _RXM0SIDL_RXM0EXIDM_LENGTH                          0x1
#define _RXM0SIDL_RXM0EXIDM_MASK                            0x8
#define _RXM0SIDL_RXM0SID0_POSN                             0x5
#define _RXM0SIDL_RXM0SID0_POSITION                         0x5
#define _RXM0SIDL_RXM0SID0_SIZE                             0x1
#define _RXM0SIDL_RXM0SID0_LENGTH                           0x1
#define _RXM0SIDL_RXM0SID0_MASK                             0x20
#define _RXM0SIDL_RXM0SID1_POSN                             0x6
#define _RXM0SIDL_RXM0SID1_POSITION                         0x6
#define _RXM0SIDL_RXM0SID1_SIZE                             0x1
#define _RXM0SIDL_RXM0SID1_LENGTH                           0x1
#define _RXM0SIDL_RXM0SID1_MASK                             0x40
#define _RXM0SIDL_RXM0SID2_POSN                             0x7
#define _RXM0SIDL_RXM0SID2_POSITION                         0x7
#define _RXM0SIDL_RXM0SID2_SIZE                             0x1
#define _RXM0SIDL_RXM0SID2_LENGTH                           0x1
#define _RXM0SIDL_RXM0SID2_MASK                             0x80

// Register: RXM0EIDH
#define RXM0EIDH RXM0EIDH
extern volatile unsigned char           RXM0EIDH            __at(0xEFA);
#ifndef _LIB_BUILD
asm("RXM0EIDH equ 0EFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXM0EID8               :1;
        unsigned RXM0EID9               :1;
        unsigned RXM0EID10              :1;
        unsigned RXM0EID11              :1;
        unsigned RXM0EID12              :1;
        unsigned RXM0EID13              :1;
        unsigned RXM0EID14              :1;
        unsigned RXM0EID15              :1;
    };
} RXM0EIDHbits_t;
extern volatile RXM0EIDHbits_t RXM0EIDHbits __at(0xEFA);
// bitfield macros
#define _RXM0EIDH_EID_POSN                                  0x0
#define _RXM0EIDH_EID_POSITION                              0x0
#define _RXM0EIDH_EID_SIZE                                  0x8
#define _RXM0EIDH_EID_LENGTH                                0x8
#define _RXM0EIDH_EID_MASK                                  0xFF
#define _RXM0EIDH_EID8_POSN                                 0x0
#define _RXM0EIDH_EID8_POSITION                             0x0
#define _RXM0EIDH_EID8_SIZE                                 0x1
#define _RXM0EIDH_EID8_LENGTH                               0x1
#define _RXM0EIDH_EID8_MASK                                 0x1
#define _RXM0EIDH_EID9_POSN                                 0x1
#define _RXM0EIDH_EID9_POSITION                             0x1
#define _RXM0EIDH_EID9_SIZE                                 0x1
#define _RXM0EIDH_EID9_LENGTH                               0x1
#define _RXM0EIDH_EID9_MASK                                 0x2
#define _RXM0EIDH_EID10_POSN                                0x2
#define _RXM0EIDH_EID10_POSITION                            0x2
#define _RXM0EIDH_EID10_SIZE                                0x1
#define _RXM0EIDH_EID10_LENGTH                              0x1
#define _RXM0EIDH_EID10_MASK                                0x4
#define _RXM0EIDH_EID11_POSN                                0x3
#define _RXM0EIDH_EID11_POSITION                            0x3
#define _RXM0EIDH_EID11_SIZE                                0x1
#define _RXM0EIDH_EID11_LENGTH                              0x1
#define _RXM0EIDH_EID11_MASK                                0x8
#define _RXM0EIDH_EID12_POSN                                0x4
#define _RXM0EIDH_EID12_POSITION                            0x4
#define _RXM0EIDH_EID12_SIZE                                0x1
#define _RXM0EIDH_EID12_LENGTH                              0x1
#define _RXM0EIDH_EID12_MASK                                0x10
#define _RXM0EIDH_EID13_POSN                                0x5
#define _RXM0EIDH_EID13_POSITION                            0x5
#define _RXM0EIDH_EID13_SIZE                                0x1
#define _RXM0EIDH_EID13_LENGTH                              0x1
#define _RXM0EIDH_EID13_MASK                                0x20
#define _RXM0EIDH_EID14_POSN                                0x6
#define _RXM0EIDH_EID14_POSITION                            0x6
#define _RXM0EIDH_EID14_SIZE                                0x1
#define _RXM0EIDH_EID14_LENGTH                              0x1
#define _RXM0EIDH_EID14_MASK                                0x40
#define _RXM0EIDH_EID15_POSN                                0x7
#define _RXM0EIDH_EID15_POSITION                            0x7
#define _RXM0EIDH_EID15_SIZE                                0x1
#define _RXM0EIDH_EID15_LENGTH                              0x1
#define _RXM0EIDH_EID15_MASK                                0x80
#define _RXM0EIDH_RXM0EID8_POSN                             0x0
#define _RXM0EIDH_RXM0EID8_POSITION                         0x0
#define _RXM0EIDH_RXM0EID8_SIZE                             0x1
#define _RXM0EIDH_RXM0EID8_LENGTH                           0x1
#define _RXM0EIDH_RXM0EID8_MASK                             0x1
#define _RXM0EIDH_RXM0EID9_POSN                             0x1
#define _RXM0EIDH_RXM0EID9_POSITION                         0x1
#define _RXM0EIDH_RXM0EID9_SIZE                             0x1
#define _RXM0EIDH_RXM0EID9_LENGTH                           0x1
#define _RXM0EIDH_RXM0EID9_MASK                             0x2
#define _RXM0EIDH_RXM0EID10_POSN                            0x2
#define _RXM0EIDH_RXM0EID10_POSITION                        0x2
#define _RXM0EIDH_RXM0EID10_SIZE                            0x1
#define _RXM0EIDH_RXM0EID10_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID10_MASK                            0x4
#define _RXM0EIDH_RXM0EID11_POSN                            0x3
#define _RXM0EIDH_RXM0EID11_POSITION                        0x3
#define _RXM0EIDH_RXM0EID11_SIZE                            0x1
#define _RXM0EIDH_RXM0EID11_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID11_MASK                            0x8
#define _RXM0EIDH_RXM0EID12_POSN                            0x4
#define _RXM0EIDH_RXM0EID12_POSITION                        0x4
#define _RXM0EIDH_RXM0EID12_SIZE                            0x1
#define _RXM0EIDH_RXM0EID12_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID12_MASK                            0x10
#define _RXM0EIDH_RXM0EID13_POSN                            0x5
#define _RXM0EIDH_RXM0EID13_POSITION                        0x5
#define _RXM0EIDH_RXM0EID13_SIZE                            0x1
#define _RXM0EIDH_RXM0EID13_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID13_MASK                            0x20
#define _RXM0EIDH_RXM0EID14_POSN                            0x6
#define _RXM0EIDH_RXM0EID14_POSITION                        0x6
#define _RXM0EIDH_RXM0EID14_SIZE                            0x1
#define _RXM0EIDH_RXM0EID14_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID14_MASK                            0x40
#define _RXM0EIDH_RXM0EID15_POSN                            0x7
#define _RXM0EIDH_RXM0EID15_POSITION                        0x7
#define _RXM0EIDH_RXM0EID15_SIZE                            0x1
#define _RXM0EIDH_RXM0EID15_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID15_MASK                            0x80

// Register: RXM0EIDL
#define RXM0EIDL RXM0EIDL
extern volatile unsigned char           RXM0EIDL            __at(0xEFB);
#ifndef _LIB_BUILD
asm("RXM0EIDL equ 0EFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXM0EID0               :1;
        unsigned RXM0EID1               :1;
        unsigned RXM0EID2               :1;
        unsigned RXM0EID3               :1;
        unsigned RXM0EID4               :1;
        unsigned RXM0EID5               :1;
        unsigned RXM0EID6               :1;
        unsigned RXM0EID7               :1;
    };
} RXM0EIDLbits_t;
