MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K80/mcu.h
extern volatile RXB1D7bits_t RXB1D7bits __at(0xF3D);
// bitfield macros
#define _RXB1D7_RXB1D7_POSN                                 0x0
#define _RXB1D7_RXB1D7_POSITION                             0x0
#define _RXB1D7_RXB1D7_SIZE                                 0x8
#define _RXB1D7_RXB1D7_LENGTH                               0x8
#define _RXB1D7_RXB1D7_MASK                                 0xFF
#define _RXB1D7_RXB1D70_POSN                                0x0
#define _RXB1D7_RXB1D70_POSITION                            0x0
#define _RXB1D7_RXB1D70_SIZE                                0x1
#define _RXB1D7_RXB1D70_LENGTH                              0x1
#define _RXB1D7_RXB1D70_MASK                                0x1
#define _RXB1D7_RXB1D71_POSN                                0x1
#define _RXB1D7_RXB1D71_POSITION                            0x1
#define _RXB1D7_RXB1D71_SIZE                                0x1
#define _RXB1D7_RXB1D71_LENGTH                              0x1
#define _RXB1D7_RXB1D71_MASK                                0x2
#define _RXB1D7_RXB1D72_POSN                                0x2
#define _RXB1D7_RXB1D72_POSITION                            0x2
#define _RXB1D7_RXB1D72_SIZE                                0x1
#define _RXB1D7_RXB1D72_LENGTH                              0x1
#define _RXB1D7_RXB1D72_MASK                                0x4
#define _RXB1D7_RXB1D73_POSN                                0x3
#define _RXB1D7_RXB1D73_POSITION                            0x3
#define _RXB1D7_RXB1D73_SIZE                                0x1
#define _RXB1D7_RXB1D73_LENGTH                              0x1
#define _RXB1D7_RXB1D73_MASK                                0x8
#define _RXB1D7_RXB1D74_POSN                                0x4
#define _RXB1D7_RXB1D74_POSITION                            0x4
#define _RXB1D7_RXB1D74_SIZE                                0x1
#define _RXB1D7_RXB1D74_LENGTH                              0x1
#define _RXB1D7_RXB1D74_MASK                                0x10
#define _RXB1D7_RXB1D75_POSN                                0x5
#define _RXB1D7_RXB1D75_POSITION                            0x5
#define _RXB1D7_RXB1D75_SIZE                                0x1
#define _RXB1D7_RXB1D75_LENGTH                              0x1
#define _RXB1D7_RXB1D75_MASK                                0x20
#define _RXB1D7_RXB1D76_POSN                                0x6
#define _RXB1D7_RXB1D76_POSITION                            0x6
#define _RXB1D7_RXB1D76_SIZE                                0x1
#define _RXB1D7_RXB1D76_LENGTH                              0x1
#define _RXB1D7_RXB1D76_MASK                                0x40
#define _RXB1D7_RXB1D77_POSN                                0x7
#define _RXB1D7_RXB1D77_POSITION                            0x7
#define _RXB1D7_RXB1D77_SIZE                                0x1
#define _RXB1D7_RXB1D77_LENGTH                              0x1
#define _RXB1D7_RXB1D77_MASK                                0x80

// Register: CANSTAT_RO0
#define CANSTAT_RO0 CANSTAT_RO0
extern volatile unsigned char           CANSTAT_RO0         __at(0xF3E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO0 equ 0F3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
    };
} CANSTAT_RO0bits_t;
extern volatile CANSTAT_RO0bits_t CANSTAT_RO0bits __at(0xF3E);
// bitfield macros
#define _CANSTAT_RO0_EICODE0_POSN                           0x0
#define _CANSTAT_RO0_EICODE0_POSITION                       0x0
#define _CANSTAT_RO0_EICODE0_SIZE                           0x1
#define _CANSTAT_RO0_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO0_EICODE0_MASK                           0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO0_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO0_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO0_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO0_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO0_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO0_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO0_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO0_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO0_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO0_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO0_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO0_EICODE4_POSN                           0x4
#define _CANSTAT_RO0_EICODE4_POSITION                       0x4
#define _CANSTAT_RO0_EICODE4_SIZE                           0x1
#define _CANSTAT_RO0_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO0_EICODE4_MASK                           0x10
#define _CANSTAT_RO0_OPMODE_POSN                            0x5
#define _CANSTAT_RO0_OPMODE_POSITION                        0x5
#define _CANSTAT_RO0_OPMODE_SIZE                            0x3
#define _CANSTAT_RO0_OPMODE_LENGTH                          0x3
#define _CANSTAT_RO0_OPMODE_MASK                            0xE0
#define _CANSTAT_RO0_EICODE1_POSN                           0x1
#define _CANSTAT_RO0_EICODE1_POSITION                       0x1
#define _CANSTAT_RO0_EICODE1_SIZE                           0x1
#define _CANSTAT_RO0_EICODE1_LENGTH                         0x1
#define _CANSTAT_RO0_EICODE1_MASK                           0x2
#define _CANSTAT_RO0_EICODE2_POSN                           0x2
#define _CANSTAT_RO0_EICODE2_POSITION                       0x2
#define _CANSTAT_RO0_EICODE2_SIZE                           0x1
#define _CANSTAT_RO0_EICODE2_LENGTH                         0x1
#define _CANSTAT_RO0_EICODE2_MASK                           0x4
#define _CANSTAT_RO0_EICODE3_POSN                           0x3
#define _CANSTAT_RO0_EICODE3_POSITION                       0x3
#define _CANSTAT_RO0_EICODE3_SIZE                           0x1
#define _CANSTAT_RO0_EICODE3_LENGTH                         0x1
#define _CANSTAT_RO0_EICODE3_MASK                           0x8
#define _CANSTAT_RO0_OPMODE0_POSN                           0x5
#define _CANSTAT_RO0_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO0_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO0_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO0_OPMODE0_MASK                           0x20
#define _CANSTAT_RO0_OPMODE1_POSN                           0x6
#define _CANSTAT_RO0_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO0_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO0_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO0_OPMODE1_MASK                           0x40
#define _CANSTAT_RO0_OPMODE2_POSN                           0x7
#define _CANSTAT_RO0_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO0_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO0_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO0_OPMODE2_MASK                           0x80
#define _CANSTAT_RO0_ICODE0_POSN                            0x1
#define _CANSTAT_RO0_ICODE0_POSITION                        0x1
#define _CANSTAT_RO0_ICODE0_SIZE                            0x1
#define _CANSTAT_RO0_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE0_MASK                            0x2
#define _CANSTAT_RO0_ICODE1_POSN                            0x2
#define _CANSTAT_RO0_ICODE1_POSITION                        0x2
#define _CANSTAT_RO0_ICODE1_SIZE                            0x1
#define _CANSTAT_RO0_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE1_MASK                            0x4
#define _CANSTAT_RO0_ICODE2_POSN                            0x3
#define _CANSTAT_RO0_ICODE2_POSITION                        0x3
#define _CANSTAT_RO0_ICODE2_SIZE                            0x1
#define _CANSTAT_RO0_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO0_ICODE2_MASK                            0x8

// Register: CANCON_RO0
#define CANCON_RO0 CANCON_RO0
extern volatile unsigned char           CANCON_RO0          __at(0xF3F);
#ifndef _LIB_BUILD
asm("CANCON_RO0 equ 0F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCON_RO0bits_t;
extern volatile CANCON_RO0bits_t CANCON_RO0bits __at(0xF3F);
// bitfield macros
#define _CANCON_RO0_FP0_POSN                                0x0
#define _CANCON_RO0_FP0_POSITION                            0x0
#define _CANCON_RO0_FP0_SIZE                                0x1
#define _CANCON_RO0_FP0_LENGTH                              0x1
#define _CANCON_RO0_FP0_MASK                                0x1
#define _CANCON_RO0_WIN0_FP1_POSN                           0x1
#define _CANCON_RO0_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO0_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO0_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO0_WIN0_FP1_MASK                           0x2
#define _CANCON_RO0_WIN1_FP2_POSN                           0x2
#define _CANCON_RO0_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO0_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO0_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO0_WIN1_FP2_MASK                           0x4
#define _CANCON_RO0_WIN2_FP3_POSN                           0x3
#define _CANCON_RO0_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO0_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO0_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO0_WIN2_FP3_MASK                           0x8
#define _CANCON_RO0_ABAT_POSN                               0x4
#define _CANCON_RO0_ABAT_POSITION                           0x4
#define _CANCON_RO0_ABAT_SIZE                               0x1
#define _CANCON_RO0_ABAT_LENGTH                             0x1
#define _CANCON_RO0_ABAT_MASK                               0x10
#define _CANCON_RO0_REQOP_POSN                              0x5
#define _CANCON_RO0_REQOP_POSITION                          0x5
#define _CANCON_RO0_REQOP_SIZE                              0x3
#define _CANCON_RO0_REQOP_LENGTH                            0x3
#define _CANCON_RO0_REQOP_MASK                              0xE0
#define _CANCON_RO0_WIN0_POSN                               0x1
#define _CANCON_RO0_WIN0_POSITION                           0x1
#define _CANCON_RO0_WIN0_SIZE                               0x1
#define _CANCON_RO0_WIN0_LENGTH                             0x1
#define _CANCON_RO0_WIN0_MASK                               0x2
#define _CANCON_RO0_WIN1_POSN                               0x2
#define _CANCON_RO0_WIN1_POSITION                           0x2
#define _CANCON_RO0_WIN1_SIZE                               0x1
#define _CANCON_RO0_WIN1_LENGTH                             0x1
#define _CANCON_RO0_WIN1_MASK                               0x4
#define _CANCON_RO0_WIN2_POSN                               0x3
#define _CANCON_RO0_WIN2_POSITION                           0x3
#define _CANCON_RO0_WIN2_SIZE                               0x1
#define _CANCON_RO0_WIN2_LENGTH                             0x1
#define _CANCON_RO0_WIN2_MASK                               0x8
#define _CANCON_RO0_FP1_POSN                                0x1
#define _CANCON_RO0_FP1_POSITION                            0x1
#define _CANCON_RO0_FP1_SIZE                                0x1
#define _CANCON_RO0_FP1_LENGTH                              0x1
#define _CANCON_RO0_FP1_MASK                                0x2
#define _CANCON_RO0_FP2_POSN                                0x2
#define _CANCON_RO0_FP2_POSITION                            0x2
#define _CANCON_RO0_FP2_SIZE                                0x1
#define _CANCON_RO0_FP2_LENGTH                              0x1
#define _CANCON_RO0_FP2_MASK                                0x4
#define _CANCON_RO0_FP3_POSN                                0x3
#define _CANCON_RO0_FP3_POSITION                            0x3
#define _CANCON_RO0_FP3_SIZE                                0x1
#define _CANCON_RO0_FP3_LENGTH                              0x1
#define _CANCON_RO0_FP3_MASK                                0x8

// Register: MDCARL
#define MDCARL MDCARL
extern volatile unsigned char           MDCARL              __at(0xF42);
#ifndef _LIB_BUILD
asm("MDCARL equ 0F42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCL                   :4;
        unsigned                        :1;
        unsigned MDCLSYNC               :1;
        unsigned MDCLPOL                :1;
        unsigned MDCLODIS               :1;
    };
    struct {
        unsigned MDCL0                  :1;
        unsigned MDCL1                  :1;
        unsigned MDCL2                  :1;
        unsigned MDCL3                  :1;
    };
} MDCARLbits_t;
extern volatile MDCARLbits_t MDCARLbits __at(0xF42);
// bitfield macros
#define _MDCARL_MDCL_POSN                                   0x0
#define _MDCARL_MDCL_POSITION                               0x0
#define _MDCARL_MDCL_SIZE                                   0x4
#define _MDCARL_MDCL_LENGTH                                 0x4
#define _MDCARL_MDCL_MASK                                   0xF
#define _MDCARL_MDCLSYNC_POSN                               0x5
#define _MDCARL_MDCLSYNC_POSITION                           0x5
#define _MDCARL_MDCLSYNC_SIZE                               0x1
#define _MDCARL_MDCLSYNC_LENGTH                             0x1
#define _MDCARL_MDCLSYNC_MASK                               0x20
#define _MDCARL_MDCLPOL_POSN                                0x6
#define _MDCARL_MDCLPOL_POSITION                            0x6
#define _MDCARL_MDCLPOL_SIZE                                0x1
#define _MDCARL_MDCLPOL_LENGTH                              0x1
#define _MDCARL_MDCLPOL_MASK                                0x40
#define _MDCARL_MDCLODIS_POSN                               0x7
#define _MDCARL_MDCLODIS_POSITION                           0x7
#define _MDCARL_MDCLODIS_SIZE                               0x1
#define _MDCARL_MDCLODIS_LENGTH                             0x1
#define _MDCARL_MDCLODIS_MASK                               0x80
#define _MDCARL_MDCL0_POSN                                  0x0
#define _MDCARL_MDCL0_POSITION                              0x0
#define _MDCARL_MDCL0_SIZE                                  0x1
#define _MDCARL_MDCL0_LENGTH                                0x1
#define _MDCARL_MDCL0_MASK                                  0x1
#define _MDCARL_MDCL1_POSN                                  0x1
#define _MDCARL_MDCL1_POSITION                              0x1
#define _MDCARL_MDCL1_SIZE                                  0x1
#define _MDCARL_MDCL1_LENGTH                                0x1
#define _MDCARL_MDCL1_MASK                                  0x2
#define _MDCARL_MDCL2_POSN                                  0x2
#define _MDCARL_MDCL2_POSITION                              0x2
#define _MDCARL_MDCL2_SIZE                                  0x1
#define _MDCARL_MDCL2_LENGTH                                0x1
#define _MDCARL_MDCL2_MASK                                  0x4
#define _MDCARL_MDCL3_POSN                                  0x3
#define _MDCARL_MDCL3_POSITION                              0x3
#define _MDCARL_MDCL3_SIZE                                  0x1
#define _MDCARL_MDCL3_LENGTH                                0x1
#define _MDCARL_MDCL3_MASK                                  0x8

// Register: MDCARH
#define MDCARH MDCARH
extern volatile unsigned char           MDCARH              __at(0xF43);
#ifndef _LIB_BUILD
asm("MDCARH equ 0F43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCH                   :4;
        unsigned                        :1;
        unsigned MDCHSYNC               :1;
        unsigned MDCHPOL                :1;
        unsigned MDCHODIS               :1;
    };
    struct {
        unsigned MDCH0                  :1;
        unsigned MDCH1                  :1;
        unsigned MDCH2                  :1;
        unsigned MDCH3                  :1;
    };
} MDCARHbits_t;
