MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K80/mcu.h
extern volatile CANSTATbits_t CANSTATbits __at(0xF6E);
// bitfield macros
#define _CANSTAT_EICODE0_POSN                               0x0
#define _CANSTAT_EICODE0_POSITION                           0x0
#define _CANSTAT_EICODE0_SIZE                               0x1
#define _CANSTAT_EICODE0_LENGTH                             0x1
#define _CANSTAT_EICODE0_MASK                               0x1
#define _CANSTAT_EICODE1_ICODE0_POSN                        0x1
#define _CANSTAT_EICODE1_ICODE0_POSITION                    0x1
#define _CANSTAT_EICODE1_ICODE0_SIZE                        0x1
#define _CANSTAT_EICODE1_ICODE0_LENGTH                      0x1
#define _CANSTAT_EICODE1_ICODE0_MASK                        0x2
#define _CANSTAT_EICODE2_ICODE1_POSN                        0x2
#define _CANSTAT_EICODE2_ICODE1_POSITION                    0x2
#define _CANSTAT_EICODE2_ICODE1_SIZE                        0x1
#define _CANSTAT_EICODE2_ICODE1_LENGTH                      0x1
#define _CANSTAT_EICODE2_ICODE1_MASK                        0x4
#define _CANSTAT_EICODE3_ICODE2_POSN                        0x3
#define _CANSTAT_EICODE3_ICODE2_POSITION                    0x3
#define _CANSTAT_EICODE3_ICODE2_SIZE                        0x1
#define _CANSTAT_EICODE3_ICODE2_LENGTH                      0x1
#define _CANSTAT_EICODE3_ICODE2_MASK                        0x8
#define _CANSTAT_EICODE4_POSN                               0x4
#define _CANSTAT_EICODE4_POSITION                           0x4
#define _CANSTAT_EICODE4_SIZE                               0x1
#define _CANSTAT_EICODE4_LENGTH                             0x1
#define _CANSTAT_EICODE4_MASK                               0x10
#define _CANSTAT_OPMODE_POSN                                0x5
#define _CANSTAT_OPMODE_POSITION                            0x5
#define _CANSTAT_OPMODE_SIZE                                0x3
#define _CANSTAT_OPMODE_LENGTH                              0x3
#define _CANSTAT_OPMODE_MASK                                0xE0
#define _CANSTAT_EICODE1_POSN                               0x1
#define _CANSTAT_EICODE1_POSITION                           0x1
#define _CANSTAT_EICODE1_SIZE                               0x1
#define _CANSTAT_EICODE1_LENGTH                             0x1
#define _CANSTAT_EICODE1_MASK                               0x2
#define _CANSTAT_EICODE2_POSN                               0x2
#define _CANSTAT_EICODE2_POSITION                           0x2
#define _CANSTAT_EICODE2_SIZE                               0x1
#define _CANSTAT_EICODE2_LENGTH                             0x1
#define _CANSTAT_EICODE2_MASK                               0x4
#define _CANSTAT_EICODE3_POSN                               0x3
#define _CANSTAT_EICODE3_POSITION                           0x3
#define _CANSTAT_EICODE3_SIZE                               0x1
#define _CANSTAT_EICODE3_LENGTH                             0x1
#define _CANSTAT_EICODE3_MASK                               0x8
#define _CANSTAT_OPMODE0_POSN                               0x5
#define _CANSTAT_OPMODE0_POSITION                           0x5
#define _CANSTAT_OPMODE0_SIZE                               0x1
#define _CANSTAT_OPMODE0_LENGTH                             0x1
#define _CANSTAT_OPMODE0_MASK                               0x20
#define _CANSTAT_OPMODE1_POSN                               0x6
#define _CANSTAT_OPMODE1_POSITION                           0x6
#define _CANSTAT_OPMODE1_SIZE                               0x1
#define _CANSTAT_OPMODE1_LENGTH                             0x1
#define _CANSTAT_OPMODE1_MASK                               0x40
#define _CANSTAT_OPMODE2_POSN                               0x7
#define _CANSTAT_OPMODE2_POSITION                           0x7
#define _CANSTAT_OPMODE2_SIZE                               0x1
#define _CANSTAT_OPMODE2_LENGTH                             0x1
#define _CANSTAT_OPMODE2_MASK                               0x80
#define _CANSTAT_ICODE0_POSN                                0x1
#define _CANSTAT_ICODE0_POSITION                            0x1
#define _CANSTAT_ICODE0_SIZE                                0x1
#define _CANSTAT_ICODE0_LENGTH                              0x1
#define _CANSTAT_ICODE0_MASK                                0x2
#define _CANSTAT_ICODE1_POSN                                0x2
#define _CANSTAT_ICODE1_POSITION                            0x2
#define _CANSTAT_ICODE1_SIZE                                0x1
#define _CANSTAT_ICODE1_LENGTH                              0x1
#define _CANSTAT_ICODE1_MASK                                0x4
#define _CANSTAT_ICODE2_POSN                                0x3
#define _CANSTAT_ICODE2_POSITION                            0x3
#define _CANSTAT_ICODE2_SIZE                                0x1
#define _CANSTAT_ICODE2_LENGTH                              0x1
#define _CANSTAT_ICODE2_MASK                                0x8

// Register: CANCON
#define CANCON CANCON
extern volatile unsigned char           CANCON              __at(0xF6F);
#ifndef _LIB_BUILD
asm("CANCON equ 0F6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCONbits_t;
extern volatile CANCONbits_t CANCONbits __at(0xF6F);
// bitfield macros
#define _CANCON_FP0_POSN                                    0x0
#define _CANCON_FP0_POSITION                                0x0
#define _CANCON_FP0_SIZE                                    0x1
#define _CANCON_FP0_LENGTH                                  0x1
#define _CANCON_FP0_MASK                                    0x1
#define _CANCON_WIN0_FP1_POSN                               0x1
#define _CANCON_WIN0_FP1_POSITION                           0x1
#define _CANCON_WIN0_FP1_SIZE                               0x1
#define _CANCON_WIN0_FP1_LENGTH                             0x1
#define _CANCON_WIN0_FP1_MASK                               0x2
#define _CANCON_WIN1_FP2_POSN                               0x2
#define _CANCON_WIN1_FP2_POSITION                           0x2
#define _CANCON_WIN1_FP2_SIZE                               0x1
#define _CANCON_WIN1_FP2_LENGTH                             0x1
#define _CANCON_WIN1_FP2_MASK                               0x4
#define _CANCON_WIN2_FP3_POSN                               0x3
#define _CANCON_WIN2_FP3_POSITION                           0x3
#define _CANCON_WIN2_FP3_SIZE                               0x1
#define _CANCON_WIN2_FP3_LENGTH                             0x1
#define _CANCON_WIN2_FP3_MASK                               0x8
#define _CANCON_ABAT_POSN                                   0x4
#define _CANCON_ABAT_POSITION                               0x4
#define _CANCON_ABAT_SIZE                                   0x1
#define _CANCON_ABAT_LENGTH                                 0x1
#define _CANCON_ABAT_MASK                                   0x10
#define _CANCON_REQOP_POSN                                  0x5
#define _CANCON_REQOP_POSITION                              0x5
#define _CANCON_REQOP_SIZE                                  0x3
#define _CANCON_REQOP_LENGTH                                0x3
#define _CANCON_REQOP_MASK                                  0xE0
#define _CANCON_WIN0_POSN                                   0x1
#define _CANCON_WIN0_POSITION                               0x1
#define _CANCON_WIN0_SIZE                                   0x1
#define _CANCON_WIN0_LENGTH                                 0x1
#define _CANCON_WIN0_MASK                                   0x2
#define _CANCON_WIN1_POSN                                   0x2
#define _CANCON_WIN1_POSITION                               0x2
#define _CANCON_WIN1_SIZE                                   0x1
#define _CANCON_WIN1_LENGTH                                 0x1
#define _CANCON_WIN1_MASK                                   0x4
#define _CANCON_WIN2_POSN                                   0x3
#define _CANCON_WIN2_POSITION                               0x3
#define _CANCON_WIN2_SIZE                                   0x1
#define _CANCON_WIN2_LENGTH                                 0x1
#define _CANCON_WIN2_MASK                                   0x8
#define _CANCON_FP1_POSN                                    0x1
#define _CANCON_FP1_POSITION                                0x1
#define _CANCON_FP1_SIZE                                    0x1
#define _CANCON_FP1_LENGTH                                  0x1
#define _CANCON_FP1_MASK                                    0x2
#define _CANCON_FP2_POSN                                    0x2
#define _CANCON_FP2_POSITION                                0x2
#define _CANCON_FP2_SIZE                                    0x1
#define _CANCON_FP2_LENGTH                                  0x1
#define _CANCON_FP2_MASK                                    0x4
#define _CANCON_FP3_POSN                                    0x3
#define _CANCON_FP3_POSITION                                0x3
#define _CANCON_FP3_SIZE                                    0x1
#define _CANCON_FP3_LENGTH                                  0x1
#define _CANCON_FP3_MASK                                    0x8

// Register: CIOCON
#define CIOCON CIOCON
extern volatile unsigned char           CIOCON              __at(0xF70);
#ifndef _LIB_BUILD
asm("CIOCON equ 0F70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKSEL                 :1;
        unsigned                        :3;
        unsigned CANCAP                 :1;
        unsigned ENDRHI                 :1;
        unsigned TX2EN                  :1;
        unsigned TX2SRC                 :1;
    };
} CIOCONbits_t;
extern volatile CIOCONbits_t CIOCONbits __at(0xF70);
// bitfield macros
#define _CIOCON_CLKSEL_POSN                                 0x0
#define _CIOCON_CLKSEL_POSITION                             0x0
#define _CIOCON_CLKSEL_SIZE                                 0x1
#define _CIOCON_CLKSEL_LENGTH                               0x1
#define _CIOCON_CLKSEL_MASK                                 0x1
#define _CIOCON_CANCAP_POSN                                 0x4
#define _CIOCON_CANCAP_POSITION                             0x4
#define _CIOCON_CANCAP_SIZE                                 0x1
#define _CIOCON_CANCAP_LENGTH                               0x1
#define _CIOCON_CANCAP_MASK                                 0x10
#define _CIOCON_ENDRHI_POSN                                 0x5
#define _CIOCON_ENDRHI_POSITION                             0x5
#define _CIOCON_ENDRHI_SIZE                                 0x1
#define _CIOCON_ENDRHI_LENGTH                               0x1
#define _CIOCON_ENDRHI_MASK                                 0x20
#define _CIOCON_TX2EN_POSN                                  0x6
#define _CIOCON_TX2EN_POSITION                              0x6
#define _CIOCON_TX2EN_SIZE                                  0x1
#define _CIOCON_TX2EN_LENGTH                                0x1
#define _CIOCON_TX2EN_MASK                                  0x40
#define _CIOCON_TX2SRC_POSN                                 0x7
#define _CIOCON_TX2SRC_POSITION                             0x7
#define _CIOCON_TX2SRC_SIZE                                 0x1
#define _CIOCON_TX2SRC_LENGTH                               0x1
#define _CIOCON_TX2SRC_MASK                                 0x80

// Register: COMSTAT
#define COMSTAT COMSTAT
extern volatile unsigned char           COMSTAT             __at(0xF71);
#ifndef _LIB_BUILD
asm("COMSTAT equ 0F71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EWARN                  :1;
        unsigned RXWARN                 :1;
        unsigned TXWARN                 :1;
        unsigned RXBP                   :1;
        unsigned TXBP                   :1;
        unsigned TXBO                   :1;
        unsigned RXB1OVFL               :1;
        unsigned RXB0OVFL               :1;
    };
    struct {
        unsigned                        :7;
        unsigned NOT_FIFOEMPTY          :1;
    };
    struct {
        unsigned                        :7;
        unsigned nFIFOEMPTY             :1;
    };
    struct {
        unsigned                        :6;
        unsigned RXBNOVFL               :1;
        unsigned FIFOEMPTY              :1;
    };
} COMSTATbits_t;
extern volatile COMSTATbits_t COMSTATbits __at(0xF71);
// bitfield macros
#define _COMSTAT_EWARN_POSN                                 0x0
#define _COMSTAT_EWARN_POSITION                             0x0
#define _COMSTAT_EWARN_SIZE                                 0x1
#define _COMSTAT_EWARN_LENGTH                               0x1
#define _COMSTAT_EWARN_MASK                                 0x1
#define _COMSTAT_RXWARN_POSN                                0x1
#define _COMSTAT_RXWARN_POSITION                            0x1
#define _COMSTAT_RXWARN_SIZE                                0x1
#define _COMSTAT_RXWARN_LENGTH                              0x1
#define _COMSTAT_RXWARN_MASK                                0x2
#define _COMSTAT_TXWARN_POSN                                0x2
#define _COMSTAT_TXWARN_POSITION                            0x2
#define _COMSTAT_TXWARN_SIZE                                0x1
#define _COMSTAT_TXWARN_LENGTH                              0x1
#define _COMSTAT_TXWARN_MASK                                0x4
#define _COMSTAT_RXBP_POSN                                  0x3
#define _COMSTAT_RXBP_POSITION                              0x3
#define _COMSTAT_RXBP_SIZE                                  0x1
#define _COMSTAT_RXBP_LENGTH                                0x1
#define _COMSTAT_RXBP_MASK                                  0x8
#define _COMSTAT_TXBP_POSN                                  0x4
#define _COMSTAT_TXBP_POSITION                              0x4
#define _COMSTAT_TXBP_SIZE                                  0x1
#define _COMSTAT_TXBP_LENGTH                                0x1
#define _COMSTAT_TXBP_MASK                                  0x10
#define _COMSTAT_TXBO_POSN                                  0x5
#define _COMSTAT_TXBO_POSITION                              0x5
#define _COMSTAT_TXBO_SIZE                                  0x1
#define _COMSTAT_TXBO_LENGTH                                0x1
#define _COMSTAT_TXBO_MASK                                  0x20
#define _COMSTAT_RXB1OVFL_POSN                              0x6
#define _COMSTAT_RXB1OVFL_POSITION                          0x6
#define _COMSTAT_RXB1OVFL_SIZE                              0x1
#define _COMSTAT_RXB1OVFL_LENGTH                            0x1
#define _COMSTAT_RXB1OVFL_MASK                              0x40
#define _COMSTAT_RXB0OVFL_POSN                              0x7
#define _COMSTAT_RXB0OVFL_POSITION                          0x7
#define _COMSTAT_RXB0OVFL_SIZE                              0x1
#define _COMSTAT_RXB0OVFL_LENGTH                            0x1
#define _COMSTAT_RXB0OVFL_MASK                              0x80
#define _COMSTAT_NOT_FIFOEMPTY_POSN                         0x7
#define _COMSTAT_NOT_FIFOEMPTY_POSITION                     0x7
#define _COMSTAT_NOT_FIFOEMPTY_SIZE                         0x1
#define _COMSTAT_NOT_FIFOEMPTY_LENGTH                       0x1
#define _COMSTAT_NOT_FIFOEMPTY_MASK                         0x80
#define _COMSTAT_nFIFOEMPTY_POSN                            0x7
#define _COMSTAT_nFIFOEMPTY_POSITION                        0x7
#define _COMSTAT_nFIFOEMPTY_SIZE                            0x1
#define _COMSTAT_nFIFOEMPTY_LENGTH                          0x1
#define _COMSTAT_nFIFOEMPTY_MASK                            0x80
#define _COMSTAT_RXBNOVFL_POSN                              0x6
#define _COMSTAT_RXBNOVFL_POSITION                          0x6
#define _COMSTAT_RXBNOVFL_SIZE                              0x1
#define _COMSTAT_RXBNOVFL_LENGTH                            0x1
#define _COMSTAT_RXBNOVFL_MASK                              0x40
#define _COMSTAT_FIFOEMPTY_POSN                             0x7
#define _COMSTAT_FIFOEMPTY_POSITION                         0x7
#define _COMSTAT_FIFOEMPTY_SIZE                             0x1
#define _COMSTAT_FIFOEMPTY_LENGTH                           0x1
#define _COMSTAT_FIFOEMPTY_MASK                             0x80

// Register: ECANCON
#define ECANCON ECANCON
extern volatile unsigned char           ECANCON             __at(0xF72);
#ifndef _LIB_BUILD
asm("ECANCON equ 0F72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EWIN                   :5;
        unsigned FIFOWM                 :1;
        unsigned MDSEL                  :2;
    };
    struct {
        unsigned EWIN0                  :1;
        unsigned EWIN1                  :1;
        unsigned EWIN2                  :1;
        unsigned EWIN3                  :1;
        unsigned EWIN4                  :1;
        unsigned                        :1;
        unsigned MDSEL0                 :1;
        unsigned MDSEL1                 :1;
    };
} ECANCONbits_t;
extern volatile ECANCONbits_t ECANCONbits __at(0xF72);
// bitfield macros
#define _ECANCON_EWIN_POSN                                  0x0
#define _ECANCON_EWIN_POSITION                              0x0
#define _ECANCON_EWIN_SIZE                                  0x5
#define _ECANCON_EWIN_LENGTH                                0x5
#define _ECANCON_EWIN_MASK                                  0x1F
#define _ECANCON_FIFOWM_POSN                                0x5
#define _ECANCON_FIFOWM_POSITION                            0x5
#define _ECANCON_FIFOWM_SIZE                                0x1
#define _ECANCON_FIFOWM_LENGTH                              0x1
#define _ECANCON_FIFOWM_MASK                                0x20
#define _ECANCON_MDSEL_POSN                                 0x6
#define _ECANCON_MDSEL_POSITION                             0x6
#define _ECANCON_MDSEL_SIZE                                 0x2
#define _ECANCON_MDSEL_LENGTH                               0x2
#define _ECANCON_MDSEL_MASK                                 0xC0
#define _ECANCON_EWIN0_POSN                                 0x0
#define _ECANCON_EWIN0_POSITION                             0x0
#define _ECANCON_EWIN0_SIZE                                 0x1
#define _ECANCON_EWIN0_LENGTH                               0x1
#define _ECANCON_EWIN0_MASK                                 0x1
#define _ECANCON_EWIN1_POSN                                 0x1
#define _ECANCON_EWIN1_POSITION                             0x1
#define _ECANCON_EWIN1_SIZE                                 0x1
#define _ECANCON_EWIN1_LENGTH                               0x1
#define _ECANCON_EWIN1_MASK                                 0x2
#define _ECANCON_EWIN2_POSN                                 0x2
#define _ECANCON_EWIN2_POSITION                             0x2
#define _ECANCON_EWIN2_SIZE                                 0x1
#define _ECANCON_EWIN2_LENGTH                               0x1
#define _ECANCON_EWIN2_MASK                                 0x4
#define _ECANCON_EWIN3_POSN                                 0x3
#define _ECANCON_EWIN3_POSITION                             0x3
#define _ECANCON_EWIN3_SIZE                                 0x1
#define _ECANCON_EWIN3_LENGTH                               0x1
#define _ECANCON_EWIN3_MASK                                 0x8
#define _ECANCON_EWIN4_POSN                                 0x4
#define _ECANCON_EWIN4_POSITION                             0x4
#define _ECANCON_EWIN4_SIZE                                 0x1
#define _ECANCON_EWIN4_LENGTH                               0x1
#define _ECANCON_EWIN4_MASK                                 0x10
#define _ECANCON_MDSEL0_POSN                                0x6
#define _ECANCON_MDSEL0_POSITION                            0x6
#define _ECANCON_MDSEL0_SIZE                                0x1
#define _ECANCON_MDSEL0_LENGTH                              0x1
#define _ECANCON_MDSEL0_MASK                                0x40
#define _ECANCON_MDSEL1_POSN                                0x7
#define _ECANCON_MDSEL1_POSITION                            0x7
#define _ECANCON_MDSEL1_SIZE                                0x1
#define _ECANCON_MDSEL1_LENGTH                              0x1
#define _ECANCON_MDSEL1_MASK                                0x80

// Register: EEDATA
#define EEDATA EEDATA
extern volatile unsigned char           EEDATA              __at(0xF73);
#ifndef _LIB_BUILD
asm("EEDATA equ 0F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEDATA                 :8;
    };
} EEDATAbits_t;
