MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K80/mcu.h
// Register: LATG
#define LATG LATG
extern volatile unsigned char           LATG                __at(0xF8F);
#ifndef _LIB_BUILD
asm("LATG equ 0F8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATG0                  :1;
        unsigned LATG1                  :1;
        unsigned LATG2                  :1;
        unsigned LATG3                  :1;
        unsigned LATG4                  :1;
    };
    struct {
        unsigned LG0                    :1;
        unsigned LG1                    :1;
        unsigned LG2                    :1;
        unsigned LG3                    :1;
        unsigned LG4                    :1;
    };
} LATGbits_t;
extern volatile LATGbits_t LATGbits __at(0xF8F);
// bitfield macros
#define _LATG_LATG0_POSN                                    0x0
#define _LATG_LATG0_POSITION                                0x0
#define _LATG_LATG0_SIZE                                    0x1
#define _LATG_LATG0_LENGTH                                  0x1
#define _LATG_LATG0_MASK                                    0x1
#define _LATG_LATG1_POSN                                    0x1
#define _LATG_LATG1_POSITION                                0x1
#define _LATG_LATG1_SIZE                                    0x1
#define _LATG_LATG1_LENGTH                                  0x1
#define _LATG_LATG1_MASK                                    0x2
#define _LATG_LATG2_POSN                                    0x2
#define _LATG_LATG2_POSITION                                0x2
#define _LATG_LATG2_SIZE                                    0x1
#define _LATG_LATG2_LENGTH                                  0x1
#define _LATG_LATG2_MASK                                    0x4
#define _LATG_LATG3_POSN                                    0x3
#define _LATG_LATG3_POSITION                                0x3
#define _LATG_LATG3_SIZE                                    0x1
#define _LATG_LATG3_LENGTH                                  0x1
#define _LATG_LATG3_MASK                                    0x8
#define _LATG_LATG4_POSN                                    0x4
#define _LATG_LATG4_POSITION                                0x4
#define _LATG_LATG4_SIZE                                    0x1
#define _LATG_LATG4_LENGTH                                  0x1
#define _LATG_LATG4_MASK                                    0x10
#define _LATG_LG0_POSN                                      0x0
#define _LATG_LG0_POSITION                                  0x0
#define _LATG_LG0_SIZE                                      0x1
#define _LATG_LG0_LENGTH                                    0x1
#define _LATG_LG0_MASK                                      0x1
#define _LATG_LG1_POSN                                      0x1
#define _LATG_LG1_POSITION                                  0x1
#define _LATG_LG1_SIZE                                      0x1
#define _LATG_LG1_LENGTH                                    0x1
#define _LATG_LG1_MASK                                      0x2
#define _LATG_LG2_POSN                                      0x2
#define _LATG_LG2_POSITION                                  0x2
#define _LATG_LG2_SIZE                                      0x1
#define _LATG_LG2_LENGTH                                    0x1
#define _LATG_LG2_MASK                                      0x4
#define _LATG_LG3_POSN                                      0x3
#define _LATG_LG3_POSITION                                  0x3
#define _LATG_LG3_SIZE                                      0x1
#define _LATG_LG3_LENGTH                                    0x1
#define _LATG_LG3_MASK                                      0x8
#define _LATG_LG4_POSN                                      0x4
#define _LATG_LG4_POSITION                                  0x4
#define _LATG_LG4_SIZE                                      0x1
#define _LATG_LG4_LENGTH                                    0x1
#define _LATG_LG4_MASK                                      0x10

// Register: SLRCON
#define SLRCON SLRCON
extern volatile unsigned char           SLRCON              __at(0xF90);
#ifndef _LIB_BUILD
asm("SLRCON equ 0F90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRA                   :1;
        unsigned SLRB                   :1;
        unsigned SLRC                   :1;
        unsigned SLRD                   :1;
        unsigned SLRE                   :1;
        unsigned SLRF                   :1;
        unsigned SLRG                   :1;
    };
} SLRCONbits_t;
extern volatile SLRCONbits_t SLRCONbits __at(0xF90);
// bitfield macros
#define _SLRCON_SLRA_POSN                                   0x0
#define _SLRCON_SLRA_POSITION                               0x0
#define _SLRCON_SLRA_SIZE                                   0x1
#define _SLRCON_SLRA_LENGTH                                 0x1
#define _SLRCON_SLRA_MASK                                   0x1
#define _SLRCON_SLRB_POSN                                   0x1
#define _SLRCON_SLRB_POSITION                               0x1
#define _SLRCON_SLRB_SIZE                                   0x1
#define _SLRCON_SLRB_LENGTH                                 0x1
#define _SLRCON_SLRB_MASK                                   0x2
#define _SLRCON_SLRC_POSN                                   0x2
#define _SLRCON_SLRC_POSITION                               0x2
#define _SLRCON_SLRC_SIZE                                   0x1
#define _SLRCON_SLRC_LENGTH                                 0x1
#define _SLRCON_SLRC_MASK                                   0x4
#define _SLRCON_SLRD_POSN                                   0x3
#define _SLRCON_SLRD_POSITION                               0x3
#define _SLRCON_SLRD_SIZE                                   0x1
#define _SLRCON_SLRD_LENGTH                                 0x1
#define _SLRCON_SLRD_MASK                                   0x8
#define _SLRCON_SLRE_POSN                                   0x4
#define _SLRCON_SLRE_POSITION                               0x4
#define _SLRCON_SLRE_SIZE                                   0x1
#define _SLRCON_SLRE_LENGTH                                 0x1
#define _SLRCON_SLRE_MASK                                   0x10
#define _SLRCON_SLRF_POSN                                   0x5
#define _SLRCON_SLRF_POSITION                               0x5
#define _SLRCON_SLRF_SIZE                                   0x1
#define _SLRCON_SLRF_LENGTH                                 0x1
#define _SLRCON_SLRF_MASK                                   0x20
#define _SLRCON_SLRG_POSN                                   0x6
#define _SLRCON_SLRG_POSITION                               0x6
#define _SLRCON_SLRG_SIZE                                   0x1
#define _SLRCON_SLRG_LENGTH                                 0x1
#define _SLRCON_SLRG_MASK                                   0x40

// Register: ODCON
#define ODCON ODCON
extern volatile unsigned char           ODCON               __at(0xF91);
#ifndef _LIB_BUILD
asm("ODCON equ 0F91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1OD                   :1;
        unsigned U2OD                   :1;
        unsigned CCP1OD                 :1;
        unsigned CCP2OD                 :1;
        unsigned CCP3OD                 :1;
        unsigned CCP4OD                 :1;
        unsigned CCP5OD                 :1;
        unsigned SSPOD                  :1;
    };
} ODCONbits_t;
