MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K80/mcu.h
extern volatile __bit                   RXF7SID9            __at(0x7266);	// @ (0xE4C * 8 + 6)
#define                                 RXF7SID9_bit        _BIT_ACCESS(RXF7SIDH,6)
// RXF8EIDL<RXF8EID0>
extern volatile __bit                   RXF8EID0            __at(0x7298);	// @ (0xE53 * 8 + 0)
#define                                 RXF8EID0_bit        _BIT_ACCESS(RXF8EIDL,0)
// RXF8EIDL<RXF8EID1>
extern volatile __bit                   RXF8EID1            __at(0x7299);	// @ (0xE53 * 8 + 1)
#define                                 RXF8EID1_bit        _BIT_ACCESS(RXF8EIDL,1)
// RXF8EIDH<RXF8EID10>
extern volatile __bit                   RXF8EID10           __at(0x7292);	// @ (0xE52 * 8 + 2)
#define                                 RXF8EID10_bit       _BIT_ACCESS(RXF8EIDH,2)
// RXF8EIDH<RXF8EID11>
extern volatile __bit                   RXF8EID11           __at(0x7293);	// @ (0xE52 * 8 + 3)
#define                                 RXF8EID11_bit       _BIT_ACCESS(RXF8EIDH,3)
// RXF8EIDH<RXF8EID12>
extern volatile __bit                   RXF8EID12           __at(0x7294);	// @ (0xE52 * 8 + 4)
#define                                 RXF8EID12_bit       _BIT_ACCESS(RXF8EIDH,4)
// RXF8EIDH<RXF8EID13>
extern volatile __bit                   RXF8EID13           __at(0x7295);	// @ (0xE52 * 8 + 5)
#define                                 RXF8EID13_bit       _BIT_ACCESS(RXF8EIDH,5)
// RXF8EIDH<RXF8EID14>
extern volatile __bit                   RXF8EID14           __at(0x7296);	// @ (0xE52 * 8 + 6)
#define                                 RXF8EID14_bit       _BIT_ACCESS(RXF8EIDH,6)
// RXF8EIDH<RXF8EID15>
extern volatile __bit                   RXF8EID15           __at(0x7297);	// @ (0xE52 * 8 + 7)
#define                                 RXF8EID15_bit       _BIT_ACCESS(RXF8EIDH,7)
// RXF8SIDL<RXF8EID16>
extern volatile __bit                   RXF8EID16           __at(0x7288);	// @ (0xE51 * 8 + 0)
#define                                 RXF8EID16_bit       _BIT_ACCESS(RXF8SIDL,0)
// RXF8SIDL<RXF8EID17>
extern volatile __bit                   RXF8EID17           __at(0x7289);	// @ (0xE51 * 8 + 1)
#define                                 RXF8EID17_bit       _BIT_ACCESS(RXF8SIDL,1)
// RXF8EIDL<RXF8EID2>
extern volatile __bit                   RXF8EID2            __at(0x729A);	// @ (0xE53 * 8 + 2)
#define                                 RXF8EID2_bit        _BIT_ACCESS(RXF8EIDL,2)
// RXF8EIDL<RXF8EID3>
extern volatile __bit                   RXF8EID3            __at(0x729B);	// @ (0xE53 * 8 + 3)
#define                                 RXF8EID3_bit        _BIT_ACCESS(RXF8EIDL,3)
// RXF8EIDL<RXF8EID4>
extern volatile __bit                   RXF8EID4            __at(0x729C);	// @ (0xE53 * 8 + 4)
#define                                 RXF8EID4_bit        _BIT_ACCESS(RXF8EIDL,4)
// RXF8EIDL<RXF8EID5>
extern volatile __bit                   RXF8EID5            __at(0x729D);	// @ (0xE53 * 8 + 5)
#define                                 RXF8EID5_bit        _BIT_ACCESS(RXF8EIDL,5)
// RXF8EIDL<RXF8EID6>
extern volatile __bit                   RXF8EID6            __at(0x729E);	// @ (0xE53 * 8 + 6)
#define                                 RXF8EID6_bit        _BIT_ACCESS(RXF8EIDL,6)
// RXF8EIDL<RXF8EID7>
extern volatile __bit                   RXF8EID7            __at(0x729F);	// @ (0xE53 * 8 + 7)
#define                                 RXF8EID7_bit        _BIT_ACCESS(RXF8EIDL,7)
// RXF8EIDH<RXF8EID8>
extern volatile __bit                   RXF8EID8            __at(0x7290);	// @ (0xE52 * 8 + 0)
#define                                 RXF8EID8_bit        _BIT_ACCESS(RXF8EIDH,0)
// RXF8EIDH<RXF8EID9>
extern volatile __bit                   RXF8EID9            __at(0x7291);	// @ (0xE52 * 8 + 1)
#define                                 RXF8EID9_bit        _BIT_ACCESS(RXF8EIDH,1)
// RXFCON1<RXF8EN>
extern volatile __bit                   RXF8EN              __at(0x7238);	// @ (0xE47 * 8 + 0)
#define                                 RXF8EN_bit          _BIT_ACCESS(RXFCON1,0)
// RXF8SIDL<RXF8EXIDEN>
extern volatile __bit                   RXF8EXIDEN          __at(0x728B);	// @ (0xE51 * 8 + 3)
#define                                 RXF8EXIDEN_bit      _BIT_ACCESS(RXF8SIDL,3)
// RXF8SIDL<RXF8SID0>
extern volatile __bit                   RXF8SID0            __at(0x728D);	// @ (0xE51 * 8 + 5)
#define                                 RXF8SID0_bit        _BIT_ACCESS(RXF8SIDL,5)
// RXF8SIDL<RXF8SID1>
extern volatile __bit                   RXF8SID1            __at(0x728E);	// @ (0xE51 * 8 + 6)
#define                                 RXF8SID1_bit        _BIT_ACCESS(RXF8SIDL,6)
// RXF8SIDH<RXF8SID10>
extern volatile __bit                   RXF8SID10           __at(0x7287);	// @ (0xE50 * 8 + 7)
#define                                 RXF8SID10_bit       _BIT_ACCESS(RXF8SIDH,7)
// RXF8SIDL<RXF8SID2>
extern volatile __bit                   RXF8SID2            __at(0x728F);	// @ (0xE51 * 8 + 7)
#define                                 RXF8SID2_bit        _BIT_ACCESS(RXF8SIDL,7)
// RXF8SIDH<RXF8SID3>
extern volatile __bit                   RXF8SID3            __at(0x7280);	// @ (0xE50 * 8 + 0)
#define                                 RXF8SID3_bit        _BIT_ACCESS(RXF8SIDH,0)
// RXF8SIDH<RXF8SID4>
extern volatile __bit                   RXF8SID4            __at(0x7281);	// @ (0xE50 * 8 + 1)
#define                                 RXF8SID4_bit        _BIT_ACCESS(RXF8SIDH,1)
// RXF8SIDH<RXF8SID5>
extern volatile __bit                   RXF8SID5            __at(0x7282);	// @ (0xE50 * 8 + 2)
#define                                 RXF8SID5_bit        _BIT_ACCESS(RXF8SIDH,2)
// RXF8SIDH<RXF8SID6>
extern volatile __bit                   RXF8SID6            __at(0x7283);	// @ (0xE50 * 8 + 3)
#define                                 RXF8SID6_bit        _BIT_ACCESS(RXF8SIDH,3)
// RXF8SIDH<RXF8SID7>
extern volatile __bit                   RXF8SID7            __at(0x7284);	// @ (0xE50 * 8 + 4)
#define                                 RXF8SID7_bit        _BIT_ACCESS(RXF8SIDH,4)
// RXF8SIDH<RXF8SID8>
extern volatile __bit                   RXF8SID8            __at(0x7285);	// @ (0xE50 * 8 + 5)
#define                                 RXF8SID8_bit        _BIT_ACCESS(RXF8SIDH,5)
// RXF8SIDH<RXF8SID9>
extern volatile __bit                   RXF8SID9            __at(0x7286);	// @ (0xE50 * 8 + 6)
#define                                 RXF8SID9_bit        _BIT_ACCESS(RXF8SIDH,6)
// RXF9EIDL<RXF9EID0>
extern volatile __bit                   RXF9EID0            __at(0x72B8);	// @ (0xE57 * 8 + 0)
#define                                 RXF9EID0_bit        _BIT_ACCESS(RXF9EIDL,0)
// RXF9EIDL<RXF9EID1>
extern volatile __bit                   RXF9EID1            __at(0x72B9);	// @ (0xE57 * 8 + 1)
#define                                 RXF9EID1_bit        _BIT_ACCESS(RXF9EIDL,1)
// RXF9EIDH<RXF9EID10>
extern volatile __bit                   RXF9EID10           __at(0x72B2);	// @ (0xE56 * 8 + 2)
#define                                 RXF9EID10_bit       _BIT_ACCESS(RXF9EIDH,2)
// RXF9EIDH<RXF9EID11>
extern volatile __bit                   RXF9EID11           __at(0x72B3);	// @ (0xE56 * 8 + 3)
#define                                 RXF9EID11_bit       _BIT_ACCESS(RXF9EIDH,3)
// RXF9EIDH<RXF9EID12>
extern volatile __bit                   RXF9EID12           __at(0x72B4);	// @ (0xE56 * 8 + 4)
#define                                 RXF9EID12_bit       _BIT_ACCESS(RXF9EIDH,4)
// RXF9EIDH<RXF9EID13>
extern volatile __bit                   RXF9EID13           __at(0x72B5);	// @ (0xE56 * 8 + 5)
#define                                 RXF9EID13_bit       _BIT_ACCESS(RXF9EIDH,5)
// RXF9EIDH<RXF9EID14>
extern volatile __bit                   RXF9EID14           __at(0x72B6);	// @ (0xE56 * 8 + 6)
#define                                 RXF9EID14_bit       _BIT_ACCESS(RXF9EIDH,6)
// RXF9EIDH<RXF9EID15>
extern volatile __bit                   RXF9EID15           __at(0x72B7);	// @ (0xE56 * 8 + 7)
#define                                 RXF9EID15_bit       _BIT_ACCESS(RXF9EIDH,7)
// RXF9SIDL<RXF9EID16>
extern volatile __bit                   RXF9EID16           __at(0x72A8);	// @ (0xE55 * 8 + 0)
#define                                 RXF9EID16_bit       _BIT_ACCESS(RXF9SIDL,0)
// RXF9SIDL<RXF9EID17>
extern volatile __bit                   RXF9EID17           __at(0x72A9);	// @ (0xE55 * 8 + 1)
#define                                 RXF9EID17_bit       _BIT_ACCESS(RXF9SIDL,1)
// RXF9EIDL<RXF9EID2>
extern volatile __bit                   RXF9EID2            __at(0x72BA);	// @ (0xE57 * 8 + 2)
#define                                 RXF9EID2_bit        _BIT_ACCESS(RXF9EIDL,2)
// RXF9EIDL<RXF9EID3>
extern volatile __bit                   RXF9EID3            __at(0x72BB);	// @ (0xE57 * 8 + 3)
#define                                 RXF9EID3_bit        _BIT_ACCESS(RXF9EIDL,3)
// RXF9EIDL<RXF9EID4>
extern volatile __bit                   RXF9EID4            __at(0x72BC);	// @ (0xE57 * 8 + 4)
#define                                 RXF9EID4_bit        _BIT_ACCESS(RXF9EIDL,4)
// RXF9EIDL<RXF9EID5>
extern volatile __bit                   RXF9EID5            __at(0x72BD);	// @ (0xE57 * 8 + 5)
#define                                 RXF9EID5_bit        _BIT_ACCESS(RXF9EIDL,5)
// RXF9EIDL<RXF9EID6>
extern volatile __bit                   RXF9EID6            __at(0x72BE);	// @ (0xE57 * 8 + 6)
#define                                 RXF9EID6_bit        _BIT_ACCESS(RXF9EIDL,6)
// RXF9EIDL<RXF9EID7>
extern volatile __bit                   RXF9EID7            __at(0x72BF);	// @ (0xE57 * 8 + 7)
#define                                 RXF9EID7_bit        _BIT_ACCESS(RXF9EIDL,7)
// RXF9EIDH<RXF9EID8>
extern volatile __bit                   RXF9EID8            __at(0x72B0);	// @ (0xE56 * 8 + 0)
#define                                 RXF9EID8_bit        _BIT_ACCESS(RXF9EIDH,0)
// RXF9EIDH<RXF9EID9>
extern volatile __bit                   RXF9EID9            __at(0x72B1);	// @ (0xE56 * 8 + 1)
#define                                 RXF9EID9_bit        _BIT_ACCESS(RXF9EIDH,1)
// RXFCON1<RXF9EN>
extern volatile __bit                   RXF9EN              __at(0x7239);	// @ (0xE47 * 8 + 1)
#define                                 RXF9EN_bit          _BIT_ACCESS(RXFCON1,1)
// RXF9SIDL<RXF9EXIDEN>
extern volatile __bit                   RXF9EXIDEN          __at(0x72AB);	// @ (0xE55 * 8 + 3)
#define                                 RXF9EXIDEN_bit      _BIT_ACCESS(RXF9SIDL,3)
// RXF9SIDL<RXF9SID0>
extern volatile __bit                   RXF9SID0            __at(0x72AD);	// @ (0xE55 * 8 + 5)
#define                                 RXF9SID0_bit        _BIT_ACCESS(RXF9SIDL,5)
// RXF9SIDL<RXF9SID1>
extern volatile __bit                   RXF9SID1            __at(0x72AE);	// @ (0xE55 * 8 + 6)
#define                                 RXF9SID1_bit        _BIT_ACCESS(RXF9SIDL,6)
// RXF9SIDH<RXF9SID10>
extern volatile __bit                   RXF9SID10           __at(0x72A7);	// @ (0xE54 * 8 + 7)
#define                                 RXF9SID10_bit       _BIT_ACCESS(RXF9SIDH,7)
// RXF9SIDL<RXF9SID2>
extern volatile __bit                   RXF9SID2            __at(0x72AF);	// @ (0xE55 * 8 + 7)
#define                                 RXF9SID2_bit        _BIT_ACCESS(RXF9SIDL,7)
// RXF9SIDH<RXF9SID3>
extern volatile __bit                   RXF9SID3            __at(0x72A0);	// @ (0xE54 * 8 + 0)
#define                                 RXF9SID3_bit        _BIT_ACCESS(RXF9SIDH,0)
// RXF9SIDH<RXF9SID4>
extern volatile __bit                   RXF9SID4            __at(0x72A1);	// @ (0xE54 * 8 + 1)
#define                                 RXF9SID4_bit        _BIT_ACCESS(RXF9SIDH,1)
// RXF9SIDH<RXF9SID5>
extern volatile __bit                   RXF9SID5            __at(0x72A2);	// @ (0xE54 * 8 + 2)
#define                                 RXF9SID5_bit        _BIT_ACCESS(RXF9SIDH,2)
// RXF9SIDH<RXF9SID6>
extern volatile __bit                   RXF9SID6            __at(0x72A3);	// @ (0xE54 * 8 + 3)
#define                                 RXF9SID6_bit        _BIT_ACCESS(RXF9SIDH,3)
// RXF9SIDH<RXF9SID7>
extern volatile __bit                   RXF9SID7            __at(0x72A4);	// @ (0xE54 * 8 + 4)
#define                                 RXF9SID7_bit        _BIT_ACCESS(RXF9SIDH,4)
// RXF9SIDH<RXF9SID8>
extern volatile __bit                   RXF9SID8            __at(0x72A5);	// @ (0xE54 * 8 + 5)
#define                                 RXF9SID8_bit        _BIT_ACCESS(RXF9SIDH,5)
// RXF9SIDH<RXF9SID9>
extern volatile __bit                   RXF9SID9            __at(0x72A6);	// @ (0xE54 * 8 + 6)
#define                                 RXF9SID9_bit        _BIT_ACCESS(RXF9SIDH,6)
// RXM0EIDL<RXM0EID0>
extern volatile __bit                   RXM0EID0            __at(0x77D8);	// @ (0xEFB * 8 + 0)
#define                                 RXM0EID0_bit        _BIT_ACCESS(RXM0EIDL,0)
// RXM0EIDL<RXM0EID1>
extern volatile __bit                   RXM0EID1            __at(0x77D9);	// @ (0xEFB * 8 + 1)
#define                                 RXM0EID1_bit        _BIT_ACCESS(RXM0EIDL,1)
// RXM0EIDH<RXM0EID10>
extern volatile __bit                   RXM0EID10           __at(0x77D2);	// @ (0xEFA * 8 + 2)
#define                                 RXM0EID10_bit       _BIT_ACCESS(RXM0EIDH,2)
// RXM0EIDH<RXM0EID11>
extern volatile __bit                   RXM0EID11           __at(0x77D3);	// @ (0xEFA * 8 + 3)
#define                                 RXM0EID11_bit       _BIT_ACCESS(RXM0EIDH,3)
// RXM0EIDH<RXM0EID12>
extern volatile __bit                   RXM0EID12           __at(0x77D4);	// @ (0xEFA * 8 + 4)
#define                                 RXM0EID12_bit       _BIT_ACCESS(RXM0EIDH,4)
// RXM0EIDH<RXM0EID13>
extern volatile __bit                   RXM0EID13           __at(0x77D5);	// @ (0xEFA * 8 + 5)
#define                                 RXM0EID13_bit       _BIT_ACCESS(RXM0EIDH,5)
// RXM0EIDH<RXM0EID14>
extern volatile __bit                   RXM0EID14           __at(0x77D6);	// @ (0xEFA * 8 + 6)
#define                                 RXM0EID14_bit       _BIT_ACCESS(RXM0EIDH,6)
// RXM0EIDH<RXM0EID15>
extern volatile __bit                   RXM0EID15           __at(0x77D7);	// @ (0xEFA * 8 + 7)
#define                                 RXM0EID15_bit       _BIT_ACCESS(RXM0EIDH,7)
// RXM0SIDL<RXM0EID16>
extern volatile __bit                   RXM0EID16           __at(0x77C8);	// @ (0xEF9 * 8 + 0)
#define                                 RXM0EID16_bit       _BIT_ACCESS(RXM0SIDL,0)
// RXM0SIDL<RXM0EID17>
extern volatile __bit                   RXM0EID17           __at(0x77C9);	// @ (0xEF9 * 8 + 1)
#define                                 RXM0EID17_bit       _BIT_ACCESS(RXM0SIDL,1)
// RXM0EIDL<RXM0EID2>
extern volatile __bit                   RXM0EID2            __at(0x77DA);	// @ (0xEFB * 8 + 2)
#define                                 RXM0EID2_bit        _BIT_ACCESS(RXM0EIDL,2)
// RXM0EIDL<RXM0EID3>
extern volatile __bit                   RXM0EID3            __at(0x77DB);	// @ (0xEFB * 8 + 3)
#define                                 RXM0EID3_bit        _BIT_ACCESS(RXM0EIDL,3)
// RXM0EIDL<RXM0EID4>
extern volatile __bit                   RXM0EID4            __at(0x77DC);	// @ (0xEFB * 8 + 4)
#define                                 RXM0EID4_bit        _BIT_ACCESS(RXM0EIDL,4)
// RXM0EIDL<RXM0EID5>
extern volatile __bit                   RXM0EID5            __at(0x77DD);	// @ (0xEFB * 8 + 5)
#define                                 RXM0EID5_bit        _BIT_ACCESS(RXM0EIDL,5)
// RXM0EIDL<RXM0EID6>
extern volatile __bit                   RXM0EID6            __at(0x77DE);	// @ (0xEFB * 8 + 6)
#define                                 RXM0EID6_bit        _BIT_ACCESS(RXM0EIDL,6)
// RXM0EIDL<RXM0EID7>
extern volatile __bit                   RXM0EID7            __at(0x77DF);	// @ (0xEFB * 8 + 7)
#define                                 RXM0EID7_bit        _BIT_ACCESS(RXM0EIDL,7)
// RXM0EIDH<RXM0EID8>
extern volatile __bit                   RXM0EID8            __at(0x77D0);	// @ (0xEFA * 8 + 0)
#define                                 RXM0EID8_bit        _BIT_ACCESS(RXM0EIDH,0)
// RXM0EIDH<RXM0EID9>
extern volatile __bit                   RXM0EID9            __at(0x77D1);	// @ (0xEFA * 8 + 1)
#define                                 RXM0EID9_bit        _BIT_ACCESS(RXM0EIDH,1)
// RXM0SIDL<RXM0EXIDM>
extern volatile __bit                   RXM0EXIDM           __at(0x77CB);	// @ (0xEF9 * 8 + 3)
#define                                 RXM0EXIDM_bit       _BIT_ACCESS(RXM0SIDL,3)
// RXM0SIDL<RXM0SID0>
extern volatile __bit                   RXM0SID0            __at(0x77CD);	// @ (0xEF9 * 8 + 5)
#define                                 RXM0SID0_bit        _BIT_ACCESS(RXM0SIDL,5)
// RXM0SIDL<RXM0SID1>
extern volatile __bit                   RXM0SID1            __at(0x77CE);	// @ (0xEF9 * 8 + 6)
#define                                 RXM0SID1_bit        _BIT_ACCESS(RXM0SIDL,6)
// RXM0SIDH<RXM0SID10>
extern volatile __bit                   RXM0SID10           __at(0x77C7);	// @ (0xEF8 * 8 + 7)
#define                                 RXM0SID10_bit       _BIT_ACCESS(RXM0SIDH,7)
// RXM0SIDL<RXM0SID2>
extern volatile __bit                   RXM0SID2            __at(0x77CF);	// @ (0xEF9 * 8 + 7)
#define                                 RXM0SID2_bit        _BIT_ACCESS(RXM0SIDL,7)
// RXM0SIDH<RXM0SID3>
extern volatile __bit                   RXM0SID3            __at(0x77C0);	// @ (0xEF8 * 8 + 0)
#define                                 RXM0SID3_bit        _BIT_ACCESS(RXM0SIDH,0)
// RXM0SIDH<RXM0SID4>
extern volatile __bit                   RXM0SID4            __at(0x77C1);	// @ (0xEF8 * 8 + 1)
#define                                 RXM0SID4_bit        _BIT_ACCESS(RXM0SIDH,1)
// RXM0SIDH<RXM0SID5>
extern volatile __bit                   RXM0SID5            __at(0x77C2);	// @ (0xEF8 * 8 + 2)
#define                                 RXM0SID5_bit        _BIT_ACCESS(RXM0SIDH,2)
// RXM0SIDH<RXM0SID6>
extern volatile __bit                   RXM0SID6            __at(0x77C3);	// @ (0xEF8 * 8 + 3)
#define                                 RXM0SID6_bit        _BIT_ACCESS(RXM0SIDH,3)
// RXM0SIDH<RXM0SID7>
extern volatile __bit                   RXM0SID7            __at(0x77C4);	// @ (0xEF8 * 8 + 4)
#define                                 RXM0SID7_bit        _BIT_ACCESS(RXM0SIDH,4)
// RXM0SIDH<RXM0SID8>
extern volatile __bit                   RXM0SID8            __at(0x77C5);	// @ (0xEF8 * 8 + 5)
#define                                 RXM0SID8_bit        _BIT_ACCESS(RXM0SIDH,5)
// RXM0SIDH<RXM0SID9>
extern volatile __bit                   RXM0SID9            __at(0x77C6);	// @ (0xEF8 * 8 + 6)
#define                                 RXM0SID9_bit        _BIT_ACCESS(RXM0SIDH,6)
// RXM1EIDL<RXM1EID0>
extern volatile __bit                   RXM1EID0            __at(0x77F8);	// @ (0xEFF * 8 + 0)
#define                                 RXM1EID0_bit        _BIT_ACCESS(RXM1EIDL,0)
// RXM1EIDL<RXM1EID1>
extern volatile __bit                   RXM1EID1            __at(0x77F9);	// @ (0xEFF * 8 + 1)
#define                                 RXM1EID1_bit        _BIT_ACCESS(RXM1EIDL,1)
// RXM1EIDH<RXM1EID10>
extern volatile __bit                   RXM1EID10           __at(0x77F2);	// @ (0xEFE * 8 + 2)
#define                                 RXM1EID10_bit       _BIT_ACCESS(RXM1EIDH,2)
// RXM1EIDH<RXM1EID11>
extern volatile __bit                   RXM1EID11           __at(0x77F3);	// @ (0xEFE * 8 + 3)
#define                                 RXM1EID11_bit       _BIT_ACCESS(RXM1EIDH,3)
// RXM1EIDH<RXM1EID12>
extern volatile __bit                   RXM1EID12           __at(0x77F4);	// @ (0xEFE * 8 + 4)
#define                                 RXM1EID12_bit       _BIT_ACCESS(RXM1EIDH,4)
// RXM1EIDH<RXM1EID13>
extern volatile __bit                   RXM1EID13           __at(0x77F5);	// @ (0xEFE * 8 + 5)
#define                                 RXM1EID13_bit       _BIT_ACCESS(RXM1EIDH,5)
// RXM1EIDH<RXM1EID14>
extern volatile __bit                   RXM1EID14           __at(0x77F6);	// @ (0xEFE * 8 + 6)
#define                                 RXM1EID14_bit       _BIT_ACCESS(RXM1EIDH,6)
// RXM1EIDH<RXM1EID15>
extern volatile __bit                   RXM1EID15           __at(0x77F7);	// @ (0xEFE * 8 + 7)
#define                                 RXM1EID15_bit       _BIT_ACCESS(RXM1EIDH,7)
// RXM1SIDL<RXM1EID16>
extern volatile __bit                   RXM1EID16           __at(0x77E8);	// @ (0xEFD * 8 + 0)
#define                                 RXM1EID16_bit       _BIT_ACCESS(RXM1SIDL,0)
// RXM1SIDL<RXM1EID17>
extern volatile __bit                   RXM1EID17           __at(0x77E9);	// @ (0xEFD * 8 + 1)
#define                                 RXM1EID17_bit       _BIT_ACCESS(RXM1SIDL,1)
// RXM1EIDL<RXM1EID2>
extern volatile __bit                   RXM1EID2            __at(0x77FA);	// @ (0xEFF * 8 + 2)
#define                                 RXM1EID2_bit        _BIT_ACCESS(RXM1EIDL,2)
// RXM1EIDL<RXM1EID3>
extern volatile __bit                   RXM1EID3            __at(0x77FB);	// @ (0xEFF * 8 + 3)
#define                                 RXM1EID3_bit        _BIT_ACCESS(RXM1EIDL,3)
// RXM1EIDL<RXM1EID4>
extern volatile __bit                   RXM1EID4            __at(0x77FC);	// @ (0xEFF * 8 + 4)
#define                                 RXM1EID4_bit        _BIT_ACCESS(RXM1EIDL,4)
// RXM1EIDL<RXM1EID5>
extern volatile __bit                   RXM1EID5            __at(0x77FD);	// @ (0xEFF * 8 + 5)
#define                                 RXM1EID5_bit        _BIT_ACCESS(RXM1EIDL,5)
// RXM1EIDL<RXM1EID6>
extern volatile __bit                   RXM1EID6            __at(0x77FE);	// @ (0xEFF * 8 + 6)
#define                                 RXM1EID6_bit        _BIT_ACCESS(RXM1EIDL,6)
// RXM1EIDL<RXM1EID7>
extern volatile __bit                   RXM1EID7            __at(0x77FF);	// @ (0xEFF * 8 + 7)
#define                                 RXM1EID7_bit        _BIT_ACCESS(RXM1EIDL,7)
// RXM1EIDH<RXM1EID8>
extern volatile __bit                   RXM1EID8            __at(0x77F0);	// @ (0xEFE * 8 + 0)
#define                                 RXM1EID8_bit        _BIT_ACCESS(RXM1EIDH,0)
// RXM1EIDH<RXM1EID9>
extern volatile __bit                   RXM1EID9            __at(0x77F1);	// @ (0xEFE * 8 + 1)
#define                                 RXM1EID9_bit        _BIT_ACCESS(RXM1EIDH,1)
// RXM1SIDL<RXM1EXIDEN>
extern volatile __bit                   RXM1EXIDEN          __at(0x77EB);	// @ (0xEFD * 8 + 3)
#define                                 RXM1EXIDEN_bit      _BIT_ACCESS(RXM1SIDL,3)
// RXM1SIDL<RXM1SID0>
extern volatile __bit                   RXM1SID0            __at(0x77ED);	// @ (0xEFD * 8 + 5)
#define                                 RXM1SID0_bit        _BIT_ACCESS(RXM1SIDL,5)
// RXM1SIDL<RXM1SID1>
extern volatile __bit                   RXM1SID1            __at(0x77EE);	// @ (0xEFD * 8 + 6)
#define                                 RXM1SID1_bit        _BIT_ACCESS(RXM1SIDL,6)
// RXM1SIDH<RXM1SID10>
extern volatile __bit                   RXM1SID10           __at(0x77E7);	// @ (0xEFC * 8 + 7)
#define                                 RXM1SID10_bit       _BIT_ACCESS(RXM1SIDH,7)
// RXM1SIDL<RXM1SID2>
extern volatile __bit                   RXM1SID2            __at(0x77EF);	// @ (0xEFD * 8 + 7)
#define                                 RXM1SID2_bit        _BIT_ACCESS(RXM1SIDL,7)
// RXM1SIDH<RXM1SID3>
extern volatile __bit                   RXM1SID3            __at(0x77E0);	// @ (0xEFC * 8 + 0)
#define                                 RXM1SID3_bit        _BIT_ACCESS(RXM1SIDH,0)
// RXM1SIDH<RXM1SID4>
extern volatile __bit                   RXM1SID4            __at(0x77E1);	// @ (0xEFC * 8 + 1)
#define                                 RXM1SID4_bit        _BIT_ACCESS(RXM1SIDH,1)
// RXM1SIDH<RXM1SID5>
extern volatile __bit                   RXM1SID5            __at(0x77E2);	// @ (0xEFC * 8 + 2)
#define                                 RXM1SID5_bit        _BIT_ACCESS(RXM1SIDH,2)
// RXM1SIDH<RXM1SID6>
